app/controllers/pics_controller.rb

INSERT INTO "pics" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Third Pic"], ["description", "jhdgfFDA"], ["created_at", "2022-11-29 06:28:51.289066"], ["updated_at", "2022-11-29 06:28:51.289066"], ["user_id", 1]]
---
    def create
    	@pic = current_user.pics.build(pic_params)

        if @pic.save

UPDATE "pics" SET "description" = ?, "updated_at" = ? WHERE "pics"."id" = ?
---
    def update
        if @pic.update(pic_params)

DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 3]]
---
    def destroy
      @pic.destroy

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_pic
    @pic = Pic.find(params[:id])